# Config file for managing brew dependencies

# Speficy bundle repo
tap 'homebrew/bundle' || true

# --------------------------------------------
# Programming Languages and Frameworks
# --------------------------------------------

brew 'java'
brew 'jenv'
brew 'maven'
brew 'node'
brew 'pyenv'
brew 'pyenv-virtualenv'
# brew 'rbenv'
# brew 'ruby-build'

# --------------------------------------------
# Utils
# --------------------------------------------

# THE UTILS
brew 'coreutils'
brew 'moreutils'
brew 'make'
brew 'findutils'
brew 'gnu-sed'
brew 'grep'
brew 'ripgrep'
brew 'gnu-getopt'

# Bash shell, better version than the one macos comes with
brew 'bash'
brew 'bash-completion'

# Zshell, the coolest shell
brew 'zsh'
brew 'zsh-completion'
brew 'fzf'

# Starship theme
brew 'starship'

# Preferred editor
brew 'neovim'
brew 'antibody'

# Terminal multiplexer
brew 'tmux'

# Versions control CLI
brew 'git'

# System monitor with graphic interface
brew 'htop'

# JSON filter: transforming json data
brew 'jq'

# Too Long Don't Read
brew 'tldr'

# Make http requests with awesome response formatting
brew 'curl'
brew 'wget'
brew 'httpie'

# Show directory structure with excellent formatting
brew 'tree'
brew 'pstree'

# Kubernetes - Our favourite containers orchestrator
brew 'kubectl'
brew 'minikube'

# Managing dotfiles
brew 'stow'

# --------------------------------------------
# Terminal gimmics xD
# --------------------------------------------

# The computer fortune teller
brew 'fortune'

# The famous cowsay
brew 'cowsay' 

# Multicolored text output
brew 'lolcat'

