# Config file for managing brew dependencies

# Speficy bundle repo
tap 'homebrew/bundle' || true

# --------------------------------------------
# Utils
# --------------------------------------------

# THE UTILS
brew 'coreutils'
brew 'moreutils'
brew 'make'
brew 'findutils'
brew 'gnu-sed'
brew 'grep'
brew 'ripgrep'
brew 'gnu-getopt'
brew 'postgresql@15'

# Bash shell, better version than the one macos comes with
brew 'bash'
brew 'bash-completion'

# Zshell, the coolest shell
brew 'zsh'
brew 'zsh-completion'
brew 'fzf'

# Starship theme
brew 'starship'

# Preferred editor
brew 'neovim'
brew 'antibody'

# Terminal multiplexer
brew 'tmux'

# Versions control CLI
brew 'git'
brew 'gh'

# System monitor with graphic interface
brew 'htop'

# JSON filter: transforming json data
brew 'jq'

# Too Long Don't Read
brew 'tldr'

# Make http requests with awesome response formatting
brew 'curl'
brew 'wget'
brew 'httpie'

# Show directory structure with excellent formatting
brew 'tree'
brew 'pstree'

# Kubernetes - Our favourite containers orchestrator
brew 'kubectl'
brew 'minikube'
brew 'helm'

# AWS tools
# brew 'aws-cli'
# brew 'aws-vault'

# Managing dotfiles
brew 'stow'

# For pyenv: https://github.com/pyenv/pyenv/wiki#suggested-build-environment
brew 'openssl'
brew 'readline'
brew 'sqlite3'
brew 'xz'
brew 'zlib'
brew 'tcl-tk'

# --------------------------------------------
# Terminal gimmics xD
# --------------------------------------------

# The computer fortune teller
brew 'fortune'

# The famous cowsay
brew 'cowsay' 

# Multicolored text output
brew 'lolcat'

# --------------------------------------------
# Apps
# --------------------------------------------

cask '1password'
cask 'docker'
cask 'git-credential-manager'
cask 'google-chrome'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'slack'
cask 'tunnelblick'

